FemDesign.Bars.Bar
bar_type
Bar-element

FemDesign.Bars.Bar._maxCompression
Truss only.
enum

FemDesign.Bars.Bar.CompressionPlasticity
Truss only.

FemDesign.Bars.Bar._maxTension
Truss only.

FemDesign.Bars.Bar.TensionPlasticity
Truss only.

FemDesign.Bars.Bar.#ctor
Parameterless constructor for serialization.

FemDesign.Bars.Bar.#ctor(FemDesign.Geometry.Edge,FemDesign.Materials.Material,FemDesign.Sections.Section,FemDesign.Bars.BarType,FemDesign.Bars.Eccentricity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with uniform section and uniform start/end conditions
edge:
type:
material:
section: Section, same at start/end
eccentricity: Analytical eccentricity, same at start. Eccentricity set to 0,0 if null/end
connectivity: Connectivity, same at start/end. Connectivity set to Rigid if null
identifier: Identifier

FemDesign.Bars.Bar.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Materials.Material,FemDesign.Sections.Section,FemDesign.Bars.BarType,FemDesign.Geometry.Vector3d,FemDesign.Bars.Eccentricity,FemDesign.Bars.Eccentricity,FemDesign.Bars.Connectivity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with uniform section and uniform start/end conditions
startPoint:
endPoint:
type:
material:
section: Section, same at start/end
localY: Vector to orient the cross section. If null, localY will be set as a cross product between Z-Axis and the local X Axis./end
startEccentricity: Analytical eccentricity. Eccentricity set to 0,0 if null/end
endEccentricity: Analytical eccentricity. Eccentricity set to 0,0 if null/end
startConnectivity: Connectivity. Connectivity set to Rigid if null/end
endConnectivity: Connectivity. Connectivity set to Rigid if null
identifier: Identifier

FemDesign.Bars.Bar.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section,FemDesign.Bars.Eccentricity,FemDesign.Bars.Eccentricity,FemDesign.Bars.Connectivity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with uniform section and different start/end conditions
edge:
type:
material:
section: Section, same at start/end
startEccentricity: Analytical start eccentricity
endEccentricity: Analytical end eccentricity
startConnectivity: Start connectivity
endConnectivity: End connectivity
identifier: Identifier

FemDesign.Bars.Bar.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section,FemDesign.Sections.Section,FemDesign.Bars.Eccentricity,FemDesign.Bars.Eccentricity,FemDesign.Bars.Connectivity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with start/end section and different start/end conditions
edge:
type:
material:
startSection: Start section
endSection: End section
startEccentricity: Analytical start eccentricity
endEccentricity: Analytical end eccentricity
startConnectivity: Start connectivity
endConnectivity: End connectivity
identifier: Identifier

FemDesign.Bars.Bar.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section[],FemDesign.Bars.Eccentricity[],FemDesign.Bars.Connectivity[],System.String)
Construct beam or column with start/end section and different start/end conditions
edge:
type:
material:
sections: List of sections, 1 (uniform) or 2 (start/end) items.
eccentricities: List of analytical eccentricities, 1 (uniform) or 2 (start/end) items.
connectivities: List of connectivities, 1 (uniform) or 2 (start/end) items.
identifier: Identifier

FemDesign.Bars.Bar.#ctor(FemDesign.Geometry.Edge,FemDesign.Bars.BarType,FemDesign.Materials.Material,FemDesign.Sections.Section[],System.Double[],FemDesign.Bars.Eccentricity[],FemDesign.Bars.Connectivity,FemDesign.Bars.Connectivity,System.String)
Construct beam or column with non-uniform section and different start/end conditions
edge:
type:
material:
sections: List of sections, 2 or more items.
positions: List of parametric (0-1) section positions, 2 or more items.
eccentricities: List of analytical eccentricities, 2 or more items.
startConnectivity: Start connectivity
endConnectivity: End connectivity
identifier: Identifier

FemDesign.Bars.Bar.#ctor(FemDesign.Geometry.Edge,FemDesign.Materials.Material,FemDesign.Sections.Section,System.String)
Construct a truss element.
edge:
material:
section:
identifier:
Throws System.Exception:

FemDesign.Bars.Bar.UpdateEntities
Update entities if this bar should be "reconstructed"